#+TITLE:      Babel: Languages
#+OPTIONS:    H:3 num:nil toc:3 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+AUTHOR:     Ian Martins
#+EMAIL:      ianxm at jhu dot edu
#+LANGUAGE:   en
#+HTML_LINK_HOME:  https://orgmode.org/worg/
#+HTML_LINK_UP:  ../index.html

*** java
#+begin_src java :results value list
  String[] ret = {"one", "two"};
  return ret;
#+end_src

#+RESULTS:
- one
- two

*** python
#+begin_src python :python python3 :results value list
return ("one", "two")
#+end_src

#+RESULTS:
- one
- two

